
use hbksw;

/* 1.2 */
insert into systemadminuser(adminid,loginname,password,truename,powertype,regdate) 
	values(100,"admin","E10ADC3949BA59ABBE56E057F20F883E","admin",7,"2014-05-16 16:16:16.166");
commit;

/* 2.0 */
INSERT INTO `plugin` VALUES (1,'高考资讯插件','高考资讯插件为您提供最及时、最权威的高考及高招信息。用户可设置推送提醒保证第一时间获知高考动态。','http://115.28.227.82/hbksy/uploadify/plugin/hbksy_1401770953910.jpg',0,NULL,0,0,1,'2014-05-01 08:00:00','2014-08-31 08:00:00',1,101),
	(2,'高招院校插件','高招院校与您一起关注高校招生。\n高招院校插件可按照招生类别、院校类别、招生批次、分数等多种搜索条件查询在湖北省招生院校。\n高招院校插件提供最全面、最准确、最快速的高校信息资源，同步更新两千余所在湖北省招生院校招生信息，并提供院校历年投档线查询以及院校答疑服务。\n注册用户可在第一时间获取关注院校的新闻动态。','http://115.28.227.82/hbksy/uploadify/plugin/hbksy_1401770978102.jpg',0,NULL,0,0,1,'2014-05-01 08:00:00','2014-08-31 08:00:00',1,101),
	(3,'高考流程插件','高考流程插件旨在为考生提供报考流程指引，考生可通过本插件方便快捷地查阅不同考试类别在各该阶段的考试政策。','http://115.28.227.82/hbksy/uploadify/plugin/hbksy_1401771000456.jpg',0,NULL,0,0,0,NULL,NULL,1,101),
	(4,'高考日历插件','高考日历为高考生量身打造考试时间表，提供考试提醒与记事功能，方便考生规划高考安排。','http://115.28.227.82/hbksy/uploadify/plugin/hbksy_1401771020649.jpg',0,NULL,0,0,0,NULL,NULL,0,101),
	(5,'高考分数推送插件','选用分数推送插件后，客户端将在第一时间把高考成绩推送到手机通知栏，考生无需在电脑或手机前反复刷新。\n本服务需要将考生相关信息（准考证号、身份证号及报名号等）与会员账号绑定，湖北招生考试客户端郑重承诺绝对保密考生个人资料。','http://115.28.227.82/hbksy/uploadify/plugin/hbksy_1401771046843.jpg',0,NULL,0,0,0,NULL,NULL,0,101),
	(6,'高考录取推送插件','高考录取工作开始后，我省将每天更新数次考生录取状态，本插件可在每次录取状态更新的同时向考生推送最新信息，考生无需在电脑前等待查阅。\n本服务需要将考生资料（准考证号、身份证号及报名号）与会员账号绑定，湖北招生考试客户端郑重承诺绝对保密考生个人资料。','http://115.28.227.82/hbksy/uploadify/plugin/hbksy_1401771080410.jpg',0,NULL,0,0,0,NULL,NULL,0,101),
	(7,'高招答疑插件','湖北招生考试网在录取期间为高考生提供官方在线答疑，选用本插件后，您可通过客户端随时随地提出疑问，提出的问题一旦被回复，将直接通过手机推送通知。','http://115.28.227.82/hbksy/uploadify/plugin/hbksy_1401771097615.jpg',0,NULL,0,0,0,NULL,NULL,0,101),
	(8,'高招备考插件',NULL,NULL,0,NULL,0,0,0,'2014-07-01 00:00:00','2014-08-31 00:00:00',0,101),
	(9,'自考资讯插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-08-31 00:00:00',0,102),
	(10,'自考院校插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-08-31 00:00:00',0,102),
	(11,'自考流程插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-08-31 00:00:00',0,102),
	(12,'自考日历插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-08-31 00:00:00',0,102),
	(13,'自考分数推送插件',NULL,NULL,0,NULL,0,0,0,'2014-04-30 13:55:04','2014-05-01 13:54:54',0,102),
	(14,'自考录取状态插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 13:55:11','2014-05-02 00:00:00',0,102),
	(15,'自考答疑插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-08-31 00:00:00',0,102),
	(16,'自考备考插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-08-31 00:00:00',0,102),
	(17,'成考资讯插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-08-31 00:00:00',0,103),
	(18,'成考院校插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-08-31 00:00:00',0,103),
	(19,'成考流程插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-08-31 00:00:00',0,103),
	(20,'成考日历插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-08-31 00:00:00',0,103),
	(21,'成考分数推送插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-05-02 00:00:00',0,103),
	(22,'成考录取状态插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-05-02 00:00:00',0,103),
	(23,'成考答疑插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-08-31 00:00:00',0,103),
	(24,'成考备考插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-08-31 00:00:00',0,103),
	(25,'研考资讯插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-08-31 00:00:00',0,104),
	(26,'研考院校插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-08-31 00:00:00',1,104),
	(27,'研考流程插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-08-31 00:00:00',0,104),
	(28,'研考日历插件',NULL,NULL,0,NULL,0,0,1,'2014-05-01 00:00:00','2014-08-31 00:00:00',0,104),
	(29,'研考分数推送插件','研考分数研考分数研考分数研考分数研考分数研考分数',NULL,1,'每条一元每条一元每条一元每条一元每条一元每条一元每条一元每条一元每条一元',0,0,1,'2014-05-01 00:00:00','2014-05-02 13:56:58',0,104),
	(30,'研考录取状态插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-05-02 00:00:00',0,104),
	(31,'研考答疑插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 00:00:00','2014-08-31 00:00:00',1,104),
	(32,'研考备考插件',NULL,NULL,0,NULL,0,0,1,'2014-05-01 00:00:00','2014-05-30 08:00:00',1,104),
	(33,'高考分数查询插件',NULL,NULL,0,NULL,0,0,0,'2014-05-01 13:46:18','2014-08-30 13:46:23',0,101),
	(34,'高考录取查询插件',NULL,NULL,0,NULL,0,0,0,'2014-04-30 13:46:58','2014-08-31 13:47:06',0,101);
commit;

INSERT INTO `pluginPackage` VALUES (1,'高考插件包','高考插件包','1,2,3,4,5,6,7,8,33,34'),
	(2,'自考插件包','自考插件包','9,10,11,12,13,14,15,16'),
	(3,'成考插件包','成考插件包','17,18,19,20,21,22,23,24'),
	(4,'研考插件包','研考插件包','25,26,27,28,29,30,31,32');
commit;

INSERT INTO `pushCategory` VALUES (1,'普通高考',1),
	(2,'艺术特长生',1),
	(3,'体育特长生',1),
	(4,'艺术高考',1),
	(5,'高水平运动员',1),
	(6,'军校国防',1),
	(7,'招飞',1),
	(8,'信息快递',9),
	(9,'招录政策',9),
	(10,'考务考籍',9),
	(11,'新闻动态',17),
	(12,'招录政策',17),
	(13,'报考指南',17),
	(14,'全日制硕士',25),
	(15,'在职硕士',25),
	(16,'高考分数查询',5),
	(17,'高考录取状态查询',6);
commit;

INSERT INTO `pushtemplate` VALUES (1,3,101,8,'{XM},{ZKZH},语文{KM1},数学{KM2},外语{KM3},综合{KM4},总分{TOT}','2014-06-08 17:53:39'),
	(2,4,101,8,'{XM},{KSH},{KSZTMC},{KLMC}','2014-06-08 17:53:51');
commit;